socialNetwork/wrk2/user-timeline-without-istio/COMMAND_55/164
Running 1m test @ http://localhost:31111/wrk2-api/user-timeline/read
  8 threads and 16 connections
  Thread calibration: mean lat.: 0.214ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.206ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.210ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.208ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.206ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.194ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.205ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.201ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   202.75us  102.74us 483.00us   91.76%
    Req/Sec   391.29     48.97   454.00     54.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  184.00us
 75.000%  224.00us
 90.000%  282.00us
 99.000%  483.00us
 99.900%    1.02ms
 99.990%    3.74ms
 99.999%    6.35ms
100.000%    6.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.015     0.000000            1         1.00
       0.136     0.100000        15358         1.11
       0.153     0.200000        30440         1.25
       0.164     0.300000        46504         1.43
       0.173     0.400000        60331         1.67
       0.184     0.500000        75477         2.00
       0.190     0.550000        82610         2.22
       0.198     0.600000        90996         2.50
       0.206     0.650000        98437         2.86
       0.214     0.700000       105141         3.33
       0.224     0.750000       112830         4.00
       0.229     0.775000       116504         4.44
       0.235     0.800000       120359         5.00
       0.242     0.825000       123974         5.71
       0.251     0.850000       127615         6.67
       0.264     0.875000       131384         8.00
       0.272     0.887500       133180         8.89
       0.282     0.900000       135071        10.00
       0.293     0.912500       136914        11.43
       0.305     0.925000       138751        13.33
       0.319     0.937500       140637        16.00
       0.327     0.943750       141647        17.78
       0.335     0.950000       142537        20.00
       0.345     0.956250       143486        22.86
       0.356     0.962500       144453        26.67
       0.369     0.968750       145327        32.00
       0.377     0.971875       145787        35.56
       0.388     0.975000       146291        40.00
       0.400     0.978125       146741        45.71
       0.415     0.981250       147199        53.33
       0.435     0.984375       147678        64.00
       0.445     0.985938       147898        71.11
       0.457     0.987500       148128        80.00
       0.472     0.989062       148362        91.43
       0.491     0.990625       148602       106.67
       0.520     0.992188       148838       128.00
       0.538     0.992969       148950       142.22
       0.554     0.993750       149067       160.00
       0.575     0.994531       149182       182.86
       0.599     0.995313       149298       213.33
       0.632     0.996094       149413       256.00
       0.655     0.996484       149475       284.44
       0.674     0.996875       149533       320.00
       0.694     0.997266       149590       365.71
       0.722     0.997656       149647       426.67
       0.773     0.998047       149708       512.00
       0.803     0.998242       149735       568.89
       0.835     0.998437       149765       640.00
       0.881     0.998633       149794       731.43
       0.952     0.998828       149823       853.33
       1.035     0.999023       149852      1024.00
       1.094     0.999121       149867      1137.78
       1.163     0.999219       149881      1280.00
       1.322     0.999316       149896      1462.86
       1.457     0.999414       149911      1706.67
       1.828     0.999512       149925      2048.00
       1.966     0.999561       149933      2275.56
       2.109     0.999609       149940      2560.00
       2.269     0.999658       149947      2925.71
       2.681     0.999707       149955      3413.33
       2.995     0.999756       149962      4096.00
       3.093     0.999780       149966      4551.11
       3.211     0.999805       149969      5120.00
       3.415     0.999829       149973      5851.43
       3.581     0.999854       149977      6826.67
       3.665     0.999878       149980      8192.00
       3.685     0.999890       149982      9102.22
       3.745     0.999902       149984     10240.00
       3.961     0.999915       149986     11702.86
       4.047     0.999927       149988     13653.33
       4.187     0.999939       149989     16384.00
       4.511     0.999945       149990     18204.44
       4.543     0.999951       149991     20480.00
       4.571     0.999957       149992     23405.71
       4.835     0.999963       149993     27306.67
       4.983     0.999969       149994     32768.00
       4.983     0.999973       149994     36408.89
       5.123     0.999976       149995     40960.00
       5.123     0.999979       149995     46811.43
       5.271     0.999982       149996     54613.33
       5.271     0.999985       149996     65536.00
       5.271     0.999986       149996     72817.78
       6.347     0.999988       149997     81920.00
       6.347     0.999989       149997     93622.86
       6.347     0.999991       149997    109226.67
       6.347     0.999992       149997    131072.00
       6.347     0.999993       149997    145635.56
       6.659     0.999994       149998    163840.00
       6.659     1.000000       149998          inf
#[Mean    =        0.203, StdDeviation   =        0.103]
#[Max     =        6.656, Total count    =       149998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  180004 requests in 1.00m, 37.77MB read
  Non-2xx or 3xx responses: 180004
Requests/sec:   2999.92
Transfer/sec:    644.51KB